# Pandas _tips _and _tricks_(Part_2)

# 08: Reverse Row Order

In [1]:
#import labries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import metrics

In [2]:
# Fist import datase from seaborn
df=sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
#Let  do reverse row  order
df.loc[: :-1].head()

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
148           6.2          3.4           5.4          2.3  virginica
147           6.5          3.0           5.2          2.0  virginica
146           6.3          2.5           5.0          1.9  virginica
145           6.7          3.0           5.2          2.3  virginica

In [4]:
# Let do reverse row order and reset index
df.loc[: :-1].reset_index(drop=True).head()

   sepal_length  sepal_width  petal_length  petal_width    species
0           5.9          3.0           5.1          1.8  virginica
1           6.2          3.4           5.4          2.3  virginica
2           6.5          3.0           5.2          2.0  virginica
3           6.3          2.5           5.0          1.9  virginica
4           6.7          3.0           5.2          2.3  virginica

# 09: Reverse Columns  Order

In [9]:
# Let do reverse column order
df.loc[:, ::-1].head()

  species  petal_width  petal_length  sepal_width  sepal_length
0  setosa          0.2           1.4          3.5           5.1
1  setosa          0.2           1.4          3.0           4.9
2  setosa          0.2           1.3          3.2           4.7
3  setosa          0.2           1.5          3.1           4.6
4  setosa          0.2           1.4          3.6           5.0

In [10]:
# Let do reverse column order and reset index
#df.loc[:, ::-1].reset_index(drop=True).head()

# 10: Select the columns By Dtype

In [13]:
df.head()
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [14]:
#Let select those columns have float dtype
df.select_dtypes(include='float64').head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [15]:
#Let other dtype of columns 
df.select_dtypes(include='object').head()

  species
0  setosa
1  setosa
2  setosa
3  setosa
4  setosa

In [16]:
# Let select Multi datatype of columns
df.select_dtypes(include=['float64','object']).head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [17]:
# If we want exclude certain datatype of columns
df.select_dtypes(exclude='float64').head()

  species
0  setosa
1  setosa
2  setosa
3  setosa
4  setosa

# 11: Convert string  into Number

In [18]:
df=pd.DataFrame({'A_col':[1,2,3],'B_col':[4,5,6],'C_col':[7,8,9]})
df.head()

   A_col  B_col  C_col
0      1      4      7
1      2      5      8
2      3      6      9

In [19]:
df.dtypes

A_col    int64
B_col    int64
C_col    int64
dtype: object

In [21]:
# Let do int covert to string 
df.astype(float).dtypes

A_col    float64
B_col    float64
C_col    float64
dtype: object

In [22]:
# Two numerice 
pd.to_numeric(df['A_col'],errors='coerce')

0    1
1    2
2    3
Name: A_col, dtype: int64

# 12: Reduce Dataframe size

In [23]:
# Fist we need to load dataset
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
# Fist we check shape of dataset
df.shape

(891, 15)

In [26]:
# Let reduce the size of data frame accoding to memory my laptop
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 313.7 KB

In [27]:
# if we take sample of dataframe like 
df.sample(frac=0.5,random_state=10).shape

(446, 15)